app/controllers/activations_controller.rb

  def create
    @user = User.find_by_login(params[:id])
---
SELECT * FROM "users" WHERE ("users"."login" = 'ashokcingla4455') LIMIT 1