app/controllers/activations_controller.rb

SELECT * FROM "users" WHERE (perishable_token = 'rhF30ry5C3kdUAsci0jc' and updated_at > '2009-11-25 18:03:03') LIMIT 1
---
  def new
    @user = User.find_using_perishable_token(params[:activation_code], 1.week) || (raise Exception,"Problem finding User using token.")

SELECT * FROM "users" WHERE ("users"."id" = '2') LIMIT 1
---
  def create
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."login" = 'bobsmith') LIMIT 1
---
  def create_activation_instructions
    debugger
    @host_with_port = request.host_with_port
    @me = User.find_by_login(params[:mylogin])