app/controllers/application_controller.rb

SELECT "users".id FROM "users" WHERE (LOWER("users"."email") = 'bobsmith@hotmail.com') LIMIT 1
---
  def find_the_user
    case
    when session["user_credentials_id"].nil?
      @the_user= "not_logged_in"
    when User.find(session["user_credentials_id"]).nil?
      @the_user= "not_logged_in"
    else
      @the_user= User.find(session["user_credentials_id"]).email