app/controllers/fortests_controller.rb

  def post_register
    a_login= params[:a_login]
#    AuthlogicBundle::Maintenance.speak = true
#    create_roles_from_rule_file
    a_user= create_user_by_login(a_login, ['customer'])
    a_user.email= "#{a_user.login}@yahoo.com"
    a_user.save
---
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "openid_identifier", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email", "state") VALUES('xEuRIMtkdWVq4VdGNLi8', NULL, '2009-12-07 07:30:39', NULL, 'JE88jlmKmONYhcQ2wgsI', '2009-12-07 07:30:39', 0, NULL, NULL, NULL, NULL, '771de129ce46e9bf581edc64f2c7ecee7444a49750dc4a64e35538a52b84afc84153df8cb72637aa29d67d6d59227e0a4ded854274548e5cff1705636665b1a5', 0, NULL, 'bobbb', NULL, 'bobbb@example.com', 'passive')
UPDATE "users" SET "login_count" = 1, "persistence_token" = '57cd3ef963444a18eaa324ffc0c276c94f5cb79333c17845ce731dc29f9cb79c1f39240b5ee76067682626590dd491a931226048615797d186f490faf595cd71', "current_login_ip" = '127.0.0.1', "updated_at" = '2009-12-09 05:46:03', "perishable_token" = 'LPXsQppWcq5X4HMDASg9', "last_request_at" = '2009-12-09 05:46:03', "state" = 'active', "current_login_at" = '2009-12-09 05:46:02', "password_salt" = 'pflNr3XsoTeOIuVrZeRi', "crypted_password" = '$2a$10$IBhiu1W27tf2P172PTKXYO/BrunfeUxJ.1XfJCwqhx8adnxDPw.2i' WHERE "id" = 1

  def post_login
    a_login= params[:a_login]
    a_user= User.find_by_login a_login
---
SELECT * FROM "users" WHERE ("users"."login" = 'bobbb') LIMIT 1