app/controllers/fortests_controller.rb

  def login
    richard= User.find_by_login "richbrown"
---
SELECT * FROM "users" WHERE ("users"."login" = 'richbrown') LIMIT 1