app/controllers/sent_controller.rb

  def index
    @messages = current_user.sent_messages.paginate :per_page => 10, :page => params[:page], :order => "created_at DESC"
---
SELECT * FROM "messages" WHERE ("messages".author_id = 1) ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def show
    @message = current_user.sent_messages.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 1 AND ("messages".author_id = 11))

  def create
    @message = current_user.sent_messages.build(params[:message])
    # Get a list of recipients
    logins = params.keys - ["commit", "action", "controller", "message"]
    # Attach them to the @message
    logins.each{ |login| @message.recipients << User.find_by_login(login) }
    if @message.save
---
INSERT INTO "messages" ("created_at", "body", "updated_at", "subject", "author_id") VALUES('2009-11-05 23:26:01', 'Hello Bob, what are you doing now?', '2009-11-05 23:26:01', 'Hello Bob', 1)
UPDATE "users" SET "updated_at" = '2009-11-05 23:26:01', "perishable_token" = 'zTdHGinwVfqioBLWofKG', "last_request_at" = '2009-11-05 23:26:01' WHERE "id" = 1