app/controllers/twitter_accounts_controller.rb

SELECT * FROM "twitter_accounts" WHERE ("twitter_accounts"."id" = 1015062144)
---
  def query_friends
    session[:friend_or_follower] = "Friends"
    session[:return_action] = "query_friends"
    @twitter_account = TwitterAccount.find(params[:id])

SELECT * FROM "twitter_accounts" WHERE ("twitter_accounts"."id" = 1015062172)
---
  def query_followers
    session[:friend_or_follower] = "Followers"
    session[:return_action] = "query_followers"
    @twitter_account = TwitterAccount.find(params[:id])

SELECT * FROM "twitter_accounts" WHERE ("twitter_accounts"."id" = 1015062180)
---
  def query_detail
    @friend_or_follower ||= "Friends"
    @twitter_account = TwitterAccount.find(params[:id])

SELECT * FROM "users" WHERE ("users"."login" = 'thubten') LIMIT 1
---
  def index
    @twitter_accounts = User.find_by_login(session[:login]).twitter_accounts

SELECT * FROM "twitter_accounts" WHERE ("twitter_accounts"."id" = 3)
---
  def show
    @twitter_account = TwitterAccount.find(params[:id])

SELECT * FROM "users" WHERE ("users"."login" = 'thubten') LIMIT 1
INSERT INTO "twitter_accounts" ("twitter_login", "created_at", "updated_at", "user_id", "twitter_pass", "twitter_email") VALUES('eugene_dentist8', '2009-11-15 00:42:30', '2009-11-15 00:42:30', 206669291, 'ph1llynyfl', '')
---
  def create
    @twitter_account = TwitterAccount.new(params[:twitter_account])
    @twitter_account.user = User.find_by_login(session[:login])
    respond_to do |format|
      if @twitter_account.save