app/controllers/twitter_accounts_controller.rb

SELECT * FROM "twitter_accounts" WHERE ("twitter_accounts".user_id = 206669298)
---
  def index
    @twitter_accounts = TwitterAccount.all