app/controllers/users_controller.rb

SELECT "users".id FROM "users" WHERE (LOWER("users"."email") = 'bob@bobt.net') LIMIT 1
INSERT INTO "users" ("single_access_token", "last_request_at", "boolean", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email", "active") VALUES('PncpIiwEp10yLMgDko5v', NULL, 'f', '2009-10-31 09:22:33', '41377258a524a217755072881a7706d04bac141c7de55b799c88896a161a2d64965f20705b1f712969bf648613cf32311a977d607b795af100405218a15166ac', 'pp6QhIR5IUHJMTiFW3f_', '2009-10-31 09:22:33', 0, NULL, 'dV__xighXSz7_epGvVo1', NULL, 'd3abe418d8ad0f0b717f286e93bc77b39ab945308bef095e0b97318bf7be87a610c26c76ee5bf6419c408f5775f517b8467ae36af862f3be8667981d95eb9f33', 0, NULL, 'xyz', NULL, 'x@x.com', 'f')
---
  def create
    if params[:user]
      params[:user][:openid_identifier]= "http://yahoo.com" if params[:user][:email]=~ /.+@yahoo.com/
      params[:user][:login]= (params[:user][:email].scan /(.+)(@.+)/).flatten.first
    end
    @user.signup!(params[:user]) do |result|
      if result
        @user.deliver_activation_instructions!
        flash[:success] = t('users.flashs.success.create')

UPDATE "users" SET "login_count" = 2, "persistence_token" = '1648198e5559bb23e239cbb74f528710464574eb65bf3bcb32761a080c2238d5f5f32ae37cfe0869c6b8acf77bd4286f9237e6fd175dd7417a6b34df24c9c228', "updated_at" = '2009-11-03 23:11:46', "perishable_token" = 'nsg5Iyp9sedHQbLLJw8U', "last_request_at" = '2009-11-03 23:11:46', "last_login_at" = '2009-11-03 23:11:46', "last_login_ip" = '127.0.0.1', "current_login_at" = '2009-11-03 23:11:46', "password_salt" = 'g2oIBpOk0DsEPCh3_Tp1', "crypted_password" = '6e886d5e2fb831e4656f058f926ba9b1687b9e93c0376d428e79ad64ec5daf3bbb8f75d409979a52b3063c80bca6588a62fcd41fb85c270b5c9251c15a3fa5c8' WHERE "id" = 1
---
  def update
    @user.attributes = params[:user]
    language_changed = @user.preference.language_changed?

    @user.save do |result|