app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."login" = 'bobsmith') LIMIT 1
---
  def change_password
    @user = User.find_by_login(session[:login])